/* Toolbar item */
"Action" = "Toiminto";
"Active" = "Aktiivinen";

/* Window title. */
"Activity" = "Toiminto";
"Allow" = "Sallittu";
"Always" = "Aina";

/* Transfer action for existing files */
"Prompt" = "Kysy mitä tehdään";

/* Toolbar item */
"{0} Bookmarks" = "{0} Kirjanmerkit";

/* Alert sheet alternate button */
"Cancel" = "Kumoa";

/* Toolbar item tooltip */
"Character Encoding" = "Merkkimuunnos";
"Choose" = "Valitse";

/* Toolbar item in Transfer Window. */
"Clean Up" = "Tyhjennä";

/* Remove all bookmarks from history. */
"Clear Menu" = "Tyhjennä valikko";

/* Toolbar item */
"Column" = "Sarake";

/* Toolbar item tooltip */
"Connect to server" = "Kytkeydy palvelimeen";

/* Copy {FTP|Web|Distribution} URL */
"{0} URL" = "{0} URL";

/* Alert sheet text */
"Could not open or read the host file" = "En voinut avata tai lukea host-tiedostoa";
"Could not open the file" = "En voinut avata tiedostoa";
"Could not show the file" = "Tiedoston näyttö ei onistu";
"Could not show the file in the Finder" = "Tiedoston näyttö Finderissä ei onistu";

/* Toolbar item tooltip */
"Create New Folder" = "Tee uusi kansio";

/* Menu item */
"Cut {0}" = "Leikkaa {0}";
"Copy {0}" = "Kopioi {0}";
"Default" = "Oletus";

/* Alert sheet title
   Alert sheet default button
   Toolbar item */
"Delete" = "Poista";
"Delete Bookmark" = "Poista kirjanmerkki";

/* Toolbar item tooltip */
"Delete file" = "Poista tiedosto";
"Deny" = "Kiellä";

/* Alert sheet default button
   Toolbar item */
"Disconnect" = "Katkaise yhteys";

/* Alert sheet title */
"Disconnect from {0}" = "Katkaise yhteys {0}";

/* Toolbar item tooltip */
"Disconnect from server" = "Katkaise yhteys palvelimeen";
"Do you want to delete the selected bookmark?" = "Haluatko poistaa valitun kirjanmerkin?";

/* Toolbar item */
"Download" = "Tuo";
"Download As:" = "Tuo nimellä:";

/* Toolbar item tooltip */
"Download file" = "Tuo tiedosto";
"Download the selected file to…" = "Tuo valitut tiedostot paikkaan…";

/* Toolbar item */
"Edit" = "Muokkaus";

/* Toolbar item tooltip */
"Edit file in external editor" = "Muokkaa tiedostoja ulkoisessa editorissa";

/* Toolbar item */
"Encoding" = "Merkkimuunnos";

/* Alert sheet title */
"Error" = "Virhe";

/* Quit application on Windows */
"Exit" = "Poistu";
"File" = "Arkisto";

/* A column in the browser */
"Filename" = "Tiedoston nimi";
"{0} Items" = "{0} kohteet";
"Folder" = "Kansio";
"FTP (File Transfer Protocol)" = "FTP (tiedostosiirto)";
"FTPS (FTP/SSL)" = "FTP-SSL (FTP TLS/SSL:n yli)";

/* Toolbar item */
"Get Info" = "Näytä tietoja";

/* Toolbar item */
"Go to Folder" = "Siirry kansioon";
"History" = "Historia";

"Invalid character in filename." = "Tiedoston nimi sisältää erikoismerkkejä.";
"Invalid character in folder name." = "Kansion nimi sisältää erikoismerkkejä.";

/* A column in the browser */
"Kind" = "Tyyppi";
"Extension" = "Extension";
"Region" = "Alue";
"Version" = "Version";

/* Toolbar item */
"List" = "Lista";
"Local" = "Paikallinen";
"Local File" = "Paikallinen tiedosto";
"Mac Line Endings (CR)" = "Mac-rivinvaihto (CR)";

/* A column in the browser */
"Modified" = "Muutosaika";

/* Move a downloaded file to the trash */
"Move to Trash" = "Siirrä roskakoriin";
"Multiple files" = "Usea tiedosto";

/* Toolbar item */
"New Connection" = "Uusi yhteys";

/* Toolbar item */
"No external editor available" = "Ulkoista editoria ei ole saatavilla";

/* Alert sheet text */
"No newer version available." = "Ei uudempaa versiota saatavilla.";
"No private key selected" = "Henkilökohtaista avainta ei ole valittuna";
/* Alert sheet title */
"No update" = "Ei päivitystä";
"None" = "Ei mitään";

/* 1.2MB of 3.4MB */
"{0} of {1}" = "{0} / {1}";

/* Alert default button
   Alert sheet default button */
"OK" = "OK";
"Open" = "Avaa";

/* Open corresponding HTTP URL in default browser tooltip */
"Open in Web Browser" = "Avaa selaimessa";

/* Toolbar item */
"Outline" = "Luettelo";

/* A column in the browser */
"Owner" = "Omistaja";

/* A column in the browser */
"Group" = "Ryhmä";
"Passive" = "Passiivinen";

/* Menu item */
"Paste {0}" = "Sijoita {0}";

/* A column in the browser */
"Permissions" = "Oikeudet";

/* Toolbar item */
"Quick Connect" = "Pikayhteys";

/* Toolbar item */
"Quick Look" = "Pikakatselu";
"Quit" = "Lopeta";
"Quit Anyway" = "Lopeta silti";

/* Confirm deleting files. */
"Delete {0} files" = "Vahvista tiedostojen poisto. Toiminntoa ei voi perua.";

/* Toolbar item */
"Refresh" = "Virkistä";

/* Toolbar item tooltip */
"Refresh directory listing" = "Virkistä hakemistolistaus";

/* Toolbar item in Transfer Window. */
"Reload" = "Tuo uudelleen";

/* Toolbar item in Transfer Window. */
"Remove" = "Poista";
"Remove completed transfers from list." = "Poista päättyneet siirrot listasta.";


"Review…" = "Tarkastele…";

/* Toolbar item in Transfer Window. */
"Search" = "Etsi";
"Server File" = "Palvelimen tiedosto";
"SFTP (SSH File Transfer Protocol)" = "SFTP (SSH-suojattu tiedostosiirto)";
"Show" = "Näytä";

/* Toolbar item tooltip */
"Show file attributes" = "Näytä tiedostoattribuutit";
"Show in Finder" = "Näytä Finderissä";

/* Toolbar item tooltip */
"Show Transfers window" = "Näytä Siirto-ikkuna";

/* A column in the browser */
"Size" = "Koko";

/* Toolbar item in Transfer Window. */
"Stop" = "Pysäytä";

/* Toolbar item tooltip */
"Switch Browser View" = "Siirry Selaus-näkymään";
"Symbolic Link (File)" = "Symbolinen linkki (tiedosto)";
"Symbolic Link (Folder)" = "Symbolinen linkki (kansio)";

/* Toolbar item */
"Synchronize {0} with" = "Synkronoi {0}";

/* Toolbar item tooltip */
"Synchronize files" = "Synkronoi tiedostot";

/* Alert sheet text */
"The connection will be closed." = "Yhteys katkaistaan.";
"There are files currently being transferred. Quit anyway?" = "Siirtojonossa on aktiivisia töitä. Lopeta silti?";

/* Alert sheet text */
"There was a problem checking for an update. Please try again later." = "Päivitysversion tarkistaminen ei onnistu. Yritä myöhemmin uudelleen.";

/* Toolbar item tooltip */
"Toggle Bookmarks" = "Näytä/kätke kirjanmerkit";
"Transfer in progress" = "Siirto käynnissä";

/* Toolbar item */
"Transfers" = "Siirto";

"Auto" = "Auto";
"Unknown" = "Nimetön";
"Unknown size" = "Tuntematon koko";

/* Toolbar item */
"Upload" = "Vie";

/* Toolbar item tooltip */
"Upload local file to the remote host" = "Siirrä paikallinen tiedosto etäpalvelimellle";

/* Toolbar item */
"View" = "Näkymä";

"You are connected to at least one remote site. Do you want to review open browsers?" = "Olet yhteydessä ainakin yhteen palvelimeen. Haluatko katsoa avoimia yhteyksiä?";
"Open Network Diagnostics" = "Avaa Verkkodiagnostiikka";
"WebDAV (Web-based Distributed Authoring and Versioning)" = "WebDAV (Web-based Distributed Authoring and Versioning)";
"WebDAV (HTTP/SSL)" = "WebDAV (HTTP/SSL)";

/* Update sources */
"Release" = "Release";
"Beta" = "Beta";
"Snapshot Builds" = "Snapshot Builds";

"Show Hidden Files" = "Näytä piilotetut tiedostot";

/* Toggle Toolbar on Windows */
"Hide Toolbar" = "Kätke työkalupalkki";
"Show Toolbar" = "Näytä työkalupalkki";
